test/stress/stressedOut.yml
config:
  target: 'http://localhost:3003'
  http:
    pool: 10
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 10
      arrivalRate: 20

scenarios:
  - flow:
    - loop:
      - get:
          url: "/"
      count: 10